library ieee;
  use ieee.std_logic_1164.all;
  use ieee.numeric_std.all;

entity rom is
  port (clk      : in  std_logic;
        endereco : in  unsigned(6 downto 0);
        dado     : out unsigned(15 downto 0)
       );
end entity;

architecture a_rom of rom is
  type mem is array (0 to 127) of unsigned(15 downto 0);
  constant conteudo_rom : mem := (
    -- Preencher RAM com números até 63
    0      => B"0010_111_000000010",   -- LD A, 2
    1      => B"0010_001_000000001",   -- LD R1, 1
    2      => B"0010_011_000000010",   -- LD R3, 2
    3      => B"0101_000_111_000_001", -- MOV R0, A
    4      => B"1101_111_011_000000",  -- SW R0, R3 (endereço em A)
    5      => B"0101_111_111_001_111", -- ADD A, A, R1
    6      => B"0101_011_011_001_111", -- ADD R3, R3, R1
    7      => B"1001_111_000111111",   -- CMPI A, 63
    8      => B"1100_00000010_1_101",  -- BGE 2
    9      => B"1111_00000_0000011",   -- JUMP 3

    -- Eliminação eficiente de múltiplos de 2
    10     => B"0010_010_000000010",   -- LD R2, 2
    11     => B"0010_011_000000100",   -- LD R3, 4
    12     => B"0101_111_011_000_001", -- MOV A, R3
    13     => B"0010_000_000000000",   -- LD R0, 0
    14     => B"1101_111_000_000000",  -- SW R0, A
    15     => B"0101_011_011_010_111", -- ADD R3, R3, R2
    16     => B"1001_011_000111111",   -- CMPI R3, 63
    17     => B"1100_00000010_1_101",  -- BGE 2
    18     => B"1111_00000_0011000",   -- JUMP 12

    -- Eliminação eficiente de múltiplos de 3
    19     => B"0010_010_000000011",   -- LD R2, 3
    20     => B"0010_011_000000110",   -- LD R3, 6
    21     => B"0101_111_011_000_001", -- MOV A, R3
    22     => B"0010_000_000000000",   -- LD R0, 0
    23     => B"1101_111_000_000000",  -- SW R0, A
    24     => B"0101_011_011_010_111", -- ADD R3, R3, R2
    25     => B"1001_011_000111111",   -- CMPI R3, 63
    26     => B"1100_00000010_1_101",  -- BGE 2
    27     => B"1111_00000_0010101",   -- JUMP 21

    -- Eliminação eficiente de múltiplos de 5
    28     => B"0010_010_000000101",   -- LD R2, 5
    29     => B"0010_011_000001010",   -- LD R3, 10
    30     => B"0101_111_011_000_001", -- MOV A, R3
    31     => B"0010_000_000000000",   -- LD R0, 0
    32     => B"1101_111_000_000000",  -- SW R0, A
    33     => B"0101_011_011_010_111", -- ADD R3, R3, R2
    34     => B"1001_011_000111111",   -- CMPI R3, 63
    35     => B"1100_00000010_1_101",  -- BGE 2
    36     => B"1111_00000_0011110",   -- JUMP 30

    -- Eliminação eficiente de múltiplos de 7
    37     => B"0010_010_000000111",   -- LD R2, 7
    38     => B"0010_011_000001110",   -- LD R3, 14
    39     => B"0101_111_011_000_001", -- MOV A, R3
    40     => B"0010_000_000000000",   -- LD R0, 0
    41     => B"1101_111_000_000000",  -- SW R0, A
    42     => B"0101_011_011_010_111", -- ADD R3, R3, R2
    43     => B"1001_011_000111111",   -- CMPI R3, 63
    44     => B"1100_00000010_1_101",  -- BGE 2
    45     => B"1111_00000_0100111",   -- JUMP 39

    -- Varredura da saída
    46     => B"0010_011_000000010",   -- LD R3, 2
    47     => B"0101_111_011_000_001", -- MOV A, R3
    48     => B"0011_000_111_000000",  -- LW R0, A
    49     => B"1001_000_000000000",   -- CMPI R0, 0
    50     => B"1100_00000010_0_010",  -- BEQ 2
    51     => B"0101_110_000_000_001", -- MOV R6, R0
    52     => B"0101_011_011_001_111", -- ADD R3, R3, R1
    53     => B"1001_011_000111111",   -- CMPI R3, 63
    54     => B"1100_00000010_1_101",  -- BGE 2
    55     => B"1111_00000_0101111",   -- JUMP 47

    others => (others => '0')
  );

begin
  process (clk)
  begin
    if (rising_edge(clk)) then
      dado <= conteudo_rom(to_integer(endereco));
    end if;
  end process;
end architecture;
